20220915134232-xla_dispatcher.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-01 Mon 16:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>XLA dispatcher</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">XLA dispatcher</h1>


<div id="outline-container-org7e051fa" class="outline-2">
<h2 id="org7e051fa">Looping primitives</h2>
<div class="outline-text-2" id="text-org7e051fa">
</div>
<div id="outline-container-orgbc79b72" class="outline-3">
<h3 id="orgbc79b72"><a target='_blank' rel='noopener noreferrer' class='external' href="https://www.tensorflow.org/xla/operation_semantics#while">While</a></h3>
<div class="outline-text-3" id="text-orgbc79b72">
<ul class="org-ul">
<li>The shape of the init parameter must be statically determined and remain fixed during iterations.</li>
<li>Result is initialized with the <code>init</code> parameter, and updated at each iteration of the body. If condition not met at the first iteration, returns <code>init</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-org45c807d" class="outline-3">
<h3 id="org45c807d"><a target='_blank' rel='noopener noreferrer' class='external' href="https://www.tensorflow.org/xla/operation_semantics#reduce">Reduce</a></h3>
</div>
<div id="outline-container-org2ee84d3" class="outline-3">
<h3 id="org2ee84d3"><a target='_blank' rel='noopener noreferrer' class='external' href="https://www.tensorflow.org/xla/operation_semantics#reducewindow">ReduceWindow</a></h3>
</div>
<div id="outline-container-orgb69aaab" class="outline-3">
<h3 id="orgb69aaab"><a target='_blank' rel='noopener noreferrer' class='external' href="https://www.tensorflow.org/xla/operation_semantics#map">Map</a></h3>
</div>
</div>

<div id="outline-container-org5897fff" class="outline-2">
<h2 id="org5897fff">Shapes</h2>
<div class="outline-text-2" id="text-org5897fff">
<p>
There does not seem to be dynamic shapes planned in XLA. But <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/google/jax/blob/0400db959be865b3ca312ca3355824f0706723c7/jax/_src/config.py#L860">this in JAX</a>. Must be a special kind of dynamic shape, i.e. that can be determined at tracing time.
</p>
</div>
</div>

<div id="outline-container-orgcf87b12" class="outline-2">
<h2 id="orgcf87b12">Links to this note</h2>
<div class="outline-text-2" id="text-orgcf87b12">
<ul class="org-ul">
<li><a href="./20220729163627-aesara.html">Aesara</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
